#{systemPropertiesjava.io.tmpdir}/mappings/log.txt

Target endpoint: http://172.18.0.1:8081/services/Mirth
Character set: UTF-8

Accept: */*


--uuid:6cd95969-498d-4810-8c1c-e178c9e413ef
Content-Type: application/xop+xml; charset=UTF-8; type="application/soap+xml"
Content-Transfer-Encoding: binary
Content-ID: <root.message@cxf.apache.org>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Header><Action soap:mustUnderstand="true" xmlns="http://www.w3.org/2005/08/addressing">urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b</Action><MessageID xmlns="http://www.w3.org/2005/08/addressing">urn:uuid:009be159-f1c1-4d47-9187-9ced4b80d535</MessageID><To xmlns="http://www.w3.org/2005/08/addressing">http://172.18.0.1:8081/services/Mirth</To><ReplyTo xmlns="http://www.w3.org/2005/08/addressing"><Address>http://www.w3.org/2005/08/addressing/anonymous</Address></ReplyTo></soap:Header><soap:Body><ns4:ProvideAndRegisterDocumentSetRequest xmlns:ns6="urn:oasis:names:tc:ebxml-regrep:xsd:query:3.0" xmlns:ns5="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:ns4="urn:ihe:iti:xds-b:2007" xmlns:ns3="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0" xmlns:ns2="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0"><ns5:SubmitObjectsRequest><ns3:RequestSlotList/><ns2:RegistryObjectList><ns2:ExtrinsicObject mimeType="application/xml" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1"><ns2:Slot name="creationTime"><ns2:ValueList><ns2:Value>20220517084808</ns2:Value></ns2:ValueList></ns2:Slot><ns2:Slot name="languageCode"><ns2:ValueList><ns2:Value>de-DE</ns2:Value></ns2:ValueList></ns2:Slot><ns2:Slot name="sourcePatientInfo"><ns2:ValueList><ns2:Value>PID-3|#in-patient</ns2:Value></ns2:ValueList></ns2:Slot><ns2:Name><ns2:LocalizedString xml:lang="de-DE" charset="UTF-8" value="Selbstmessung"/></ns2:Name><ns2:Classification classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" nodeRepresentation="DUR" id="urn:uuid:2330234c-15f0-43f8-a9b8-68e1419f9eb7"><ns2:Slot name="codingScheme"><ns2:ValueList><ns2:Value>urn:oid:1.3.6.1.4.1.19376.3.276.1.5.8</ns2:Value></ns2:ValueList></ns2:Slot></ns2:Classification><ns2:Classification classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" nodeRepresentation="FUNK" id="urn:uuid:6cd98256-8f4a-47b4-9d20-a23c9a77a4af"><ns2:Slot name="codingScheme"><ns2:ValueList><ns2:Value>urn:oid:1.3.6.1.4.1.19376.3.276.1.5.9</ns2:Value></ns2:ValueList></ns2:Slot><ns2:Name><ns2:LocalizedString xml:lang="en-US" charset="UTF-8" value="Ergebnisse Funktionsdiagnostik"/></ns2:Name></ns2:Classification><ns2:Classification classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" nodeRepresentation="N" id="urn:uuid:9f5b1a9d-530d-4d66-bf15-1a8be6b02cd9"><ns2:Slot name="codingScheme"><ns2:ValueList><ns2:Value>urn:oid:2.16.840.1.113883.5.25</ns2:Value></ns2:ValueList></ns2:Slot></ns2:Classification><ns2:Classification classificationScheme="urn:uuid:2c6b8cb7-8b2a-4051-b291-b1ae6a575ef4" nodeRepresentation="H1" id="urn:uuid:088e48e8-59d9-4341-8641-15200b6efea4"><ns2:Name><ns2:LocalizedString xml:lang="de-DE" charset="UTF-8" value="vom Patienten mitgebracht"/></ns2:Name></ns2:Classification><ns2:Classification classificationScheme="urn:uuid:2c6b8cb7-8b2a-4051-b291-b1ae6a575ef4" nodeRepresentation="E300" id="urn:uuid:e69e03eb-28b0-42d3-bb2c-4845a81fbb35"><ns2:Name><ns2:LocalizedString xml:lang="de-DE" charset="UTF-8" value="Behandlung im häuslichen Umfeld"/></ns2:Name></ns2:Classification><ns2:Classification classificationScheme="urn:uuid:2c6b8cb7-8b2a-4051-b291-b1ae6a575ef4" nodeRepresentation="PAT" id="urn:uuid:9b233a4e-c817-4ac5-801c-c3fd0b23a8be"><ns2:Name><ns2:LocalizedString xml:lang="de-DE" charset="UTF-8" value="Patient außerhalb der Betreuung"/></ns2:Name></ns2:Classification><ns2:Classification classificationScheme="urn:uuid:2c6b8cb7-8b2a-4051-b291-b1ae6a575ef4" nodeRepresentation="PAT" id="urn:uuid:bad56f22-d23b-4bda-b74e-07f1be53f645"><ns2:Name><ns2:LocalizedString xml:lang="de-DE" charset="UTF-8" value="Patient außerhalb Betreuung"/></ns2:Name></ns2:Classification><ns2:ExternalIdentifier identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" value="Patient/me_" id="urn:uuid:8b9b95b5-3aaa-44b5-8a73-b82fa24fc056"><ns2:Name><ns2:LocalizedString value="XDSDocumentEntry.patientId"/></ns2:Name></ns2:ExternalIdentifier></ns2:ExtrinsicObject><ns2:RegistryPackage/><ns2:Classification classificationNode="urn:uuid:d9d542f3-6cc4-48b6-8870-ea235fbc94c2" id="urn:uuid:d4d37399-bb21-467f-a008-dc9bf54953f1"/><ns2:RegistryPackage id="urn:uuid:a06cce97-0ca3-400a-9ec8-c71a473b6d02"><ns2:Slot name="submissionTime"><ns2:ValueList><ns2:Value>20220616170719</ns2:Value></ns2:ValueList></ns2:Slot><ns2:Classification classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d" classifiedObject="urn:uuid:a06cce97-0ca3-400a-9ec8-c71a473b6d02" nodeRepresentation="" id="urn:uuid:79b09cdc-86f6-4ead-a212-8826d792b390"><ns2:Slot name="authorPerson"><ns2:ValueList><ns2:Value>102</ns2:Value></ns2:ValueList></ns2:Slot></ns2:Classification><ns2:Classification classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500" classifiedObject="urn:uuid:a06cce97-0ca3-400a-9ec8-c71a473b6d02" nodeRepresentation="11" id="urn:uuid:93d59b37-69bf-4d0e-871a-821b2c218a49"><ns2:Slot name="codingScheme"><ns2:ValueList><ns2:Value>urn:oid:1.3.6.1.4.1.19376.3.276.1.5.12</ns2:Value></ns2:ValueList></ns2:Slot><ns2:Name><ns2:LocalizedString xml:lang="en-US" charset="UTF-8" value="Monitoring"/></ns2:Name></ns2:Classification><ns2:ExternalIdentifier registryObject="urn:uuid:a06cce97-0ca3-400a-9ec8-c71a473b6d02" identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" value="Patient/me_" id="urn:uuid:4dab5a0f-728d-426e-b7d9-67d55e5bd633"><ns2:Name><ns2:LocalizedString value="XDSSubmissionSet.patientId"/></ns2:Name></ns2:ExternalIdentifier><ns2:ExternalIdentifier registryObject="urn:uuid:a06cce97-0ca3-400a-9ec8-c71a473b6d02" identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832" value="1.2.276.0.76.4.15.1.1.10.16" id="urn:uuid:b28004ad-6b09-4ee9-98b8-b456392af1ae"><ns2:Name><ns2:LocalizedString value="XDSSubmissionSet.sourceId"/></ns2:Name></ns2:ExternalIdentifier></ns2:RegistryPackage><ns2:Classification classifiedObject="urn:uuid:a06cce97-0ca3-400a-9ec8-c71a473b6d02" classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" id="urn:uuid:4cd7d2af-b410-4121-aafd-e7b2090c4aa0"/><ns2:Association/></ns2:RegistryObjectList></ns5:SubmitObjectsRequest></ns4:ProvideAndRegisterDocumentSetRequest></soap:Body></soap:Envelope>
--uuid:6cd95969-498d-4810-8c1c-e178c9e413ef--